In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('movie_revenues.csv')
# select only the columns we want id  revenue original_title
df = df[['id', 'revenue', 'original_title']]

In [3]:
df['R'] = df['revenue'].apply(lambda x: x/1000000)
df.head()

      id     revenue                original_title            R
0  19995  2787965087                        Avatar  2787.965087
1   1819   130431368            You, Me and Dupree   130.431368
2   2575    28008462          The Tailor of Panama    28.008462
3  26791      852206                  Brigham City     0.852206
4    644   235926552  A.I. Artificial Intelligence   235.926552

In [4]:
mean = df['R'].mean()
std = df['R'].std()
median = df['R'].median()
mean,std,median

(187.92889841304347, 455.1144234195408, 83.8171415)

In [5]:
def zscore(x):
    return (x-mean)/std

In [6]:
df['zscores'] = df['R'].apply(zscore)
df.head()

      id     revenue                original_title            R   zscores
0  19995  2787965087                        Avatar  2787.965087  5.712929
1   1819   130431368            You, Me and Dupree   130.431368 -0.126336
2   2575    28008462          The Tailor of Panama    28.008462 -0.351385
3  26791      852206                  Brigham City     0.852206 -0.411054
4    644   235926552  A.I. Artificial Intelligence   235.926552  0.105463

In [7]:
outliers = df[df['zscores'] > 3]
outliers

      id     revenue original_title            R   zscores
0  19995  2787965087         Avatar  2787.965087  5.712929

In [8]:
def getMad(x):
    median = x.median() 
    diff= abs(x - median)
    mad = diff.median()
    return mad

In [9]:
MAD = getMad(df['R'])
MAD

56.399542499999995

In [10]:
def get_modified_z_score(x):
    return 0.6745 * (x - median) / MAD

In [11]:
df["modZScore"] = df['R'].apply(get_modified_z_score)
df.head()

,id,revenue,original_title,R,zscores,modZScore
0,19995,2787965087,Avatar,2787.965087,5.712929,32.339762
1,1819,130431368,"You, Me and Dupree",130.431368,-0.126336,0.557474
2,2575,28008462,The Tailor of Panama,28.008462,-0.351385,-0.667434
3,26791,852206,Brigham City,0.852206,-0.411054,-0.992204
4,644,235926552,A.I. Artificial Intelligence,235.926552,0.105463,1.819125

In [12]:
df = df[df.modZScore>3.5]